# 1.Вводится список целых чисел в одну строчку через пробел.
# Необходимо оставить в нем только двузначные числа.
# Реализовать программу с использованием функции filter.
# Результат отобразить на экране в виде последовательности оставшихся чисел
# в одну строчку через пробел.

# ======================= OPTION 1 ====================================
# list1 = [15, 3, 56, 8, 19, 2, 5, 80, 556, 5]

# res = list(filter(lambda x: 10 <= x <= 99, list1))

# print(res)

# ======================= OPTION 2 ====================================
print(*filter(lambda x: len(str(abs(int(x)))) == 2, input().split()))
# * before filter is needed in order to print the contents without the need to make it as list
